app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "title"], ["body", "Lorem"], ["created_at", "2020-09-30 16:01:05.098223"], ["updated_at", "2020-09-30 16:01:05.098223"], ["user_id", 1]]

  def destroy
    set_post
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]